# FloorParamSpanDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FloorParamSpanDirection Property
ParameterTypeId Class See Also
---
"Span Direction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FloorParamSpanDirection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorParamSpanDirection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FloorParamSpanDirection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace